Revit 2024 API
BrowserOrganization.SortingParameterId Property
 The Id of the parameter used to determine the sorting order of items in the browser.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public ElementId SortingParameterId { get; }
Visual Basic
Public ReadOnly Property SortingParameterId As ElementId
	Get
Visual C++
public:
property ElementId^ SortingParameterId {
	ElementId^ get ();
}
See Also
BrowserOrganization Class
Autodesk.Revit.DB Namespace